Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA684" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT161" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT161" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA688" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT162" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT162" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA68C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT163" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT163" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA690" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT164" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT164" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA694" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT165" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT165" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA698" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT166" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT166" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA69C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT167" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT167" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
